Revit 2027 API
StairsPath.UpText Property
 The stairs up text.
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public string UpText { get; set; }
Public Property UpText As String
	Get
	Set
public:
property String^ UpText {
	String^ get ();
	void set (String^ value);
}
member UpText : string with get, set
Property Value
String
Exceptions
Exception | Condition
ArgumentNullException |  When setting this property: A non-optional argument was null
InvalidOperationException |  When setting this property: The stairs path doesn't not show up text so the data being set is inapplicable.
See Also
Reference
StairsPath Class
Autodesk.Revit.DB.Architecture Namespace